app/Controllers/LoginController.php

	public function login() {
		if($this->request->getMethod() == 'POST') {
			$utilisateurModel = new UtilisateurModel();
			$utilisateur = $utilisateurModel->where('mail', $this->request->getVar('identifiant'))->first();

			if (!$utilisateur) {
				$utilisateur = $utilisateurModel->where('username', $this->request->getVar('identifiant'))->first();
---
SELECT *
FROM "utilisateur"
WHERE "email" IS NULL
 LIMIT 1
SELECT *
FROM "utilisateur"
WHERE "username" IS NULL
 LIMIT 1